CREATE TABLE Dishes
(
    Id SERIAL PRIMARY KEY,
    Name VARCHAR(512) NOT NULL,
    Weight INT NOT NULL,
    CaloriesD INT NOT NULL
);

CREATE TABLE Rations
(
    Id   SERIAL PRIMARY KEY,
    CountBr INT NOT NULL,
    Breakf INT[] NOT NULL,
    CountL INT NOT NULL,
    Lunch  INT[] NOT NULL,
    CountP INT NOT NULL,
    Poldnik INT[] NOT NULL,
    CountD INT NOT NULL,
    Dinner INT[] NOT NULL
);

CREATE TABLE Person
(
    Id   SERIAL PRIMARY KEY,
    Age VARCHAR(8) NOT NULL,
    Gender VARCHAR(8) NOT NULL,
    Type VARCHAR(256) NOT NULL,
    Calories INT NOT NULL,
    Protein INT NOT NULL,
    Fat INT NOT NULL,
    Carbon INT NOT NULL,
    VitA VARCHAR(4) NOT NULL,
    VitC VARCHAR(4) NOT NULL,
    RationId INT REFERENCES Rations (Id) NOT NULL DEFAULT 1
);

INSERT INTO Dishes(Name, Weight, CaloriesD)
VALUES ('Каша из овсяных хлопьев с карамельными яблоками', 150, 324),
       ('Омлет', 50, 77),
       ('Молоко', 150, 63),
       ('Тыквенный суп-пюре с курицей',200 ,97),
       ('Салат из овощей(помидоры и огурцы)', 50, 18),
       ('Банановый смузи с овсянкой', 150, 120),
       ('Печенье', 25, 125),
       ('Тушеные овощи с фрикадельками', 200, 220),
       ('Сок апельсиновый', 100, 54),
       ('Хлеб пшеничный', 30, 51),
       ('Каша гречневая с молоком', 250, 257),
       ('Хлеб с сыром', 25, 62),
       ('Яблочные дольки', 100, 38),
       ('Щи со сметаной', 200, 120),
       ('Тефтели с макаронами', 200, 413),
       ('Компот из сухофруктов', 100, 57),
       ('Кефир', 50, 20),
       ('Морковно-яблочная запеканка', 100, 112),
       ('Каша рисовая молочная', 250, 282),
       ('Какао с молоком', 100, 74),
       ('Салат свекольно-яблочный', 150, 82),
       ('Котлета мясная', 100, 270),
       ('Отварная цветная капуста', 50, 13),
       ('Кисель', 100, 120),
       ('Йогурт черничный', 50, 45),
       ('Яблоко', 150, 82),
       ('Омлет', 100, 77),
       ('Капуста тушеная', 75, 59),
       ('Чай с сахаром', 100, 10),
       ('Каша гречневая с молоком', 250, 257),
        ('Каша овсяная молочная', 200, 137),
        ('Какао с молоком', 200, 148),
        ('Салат овощной', 50, 18),
        ('Борщ со сметаной', 150, 107),
        ('Плов с мясом', 100, 219),
        ('Отвар шиповника', 150, 25)
 ('Рисовая каша с изюмом и яблоками', 200, 169),
('Какао', 150, 87),
('Белый хлеб с маслом и сыром', 50, 143),
('Гороховый суп', 200, 122),
('Салат овощной', 100, 35),
('Картофельное пюре', 100, 88),
('Кисель', 100, 53),
('Черный хлеб', 30, 51),
('Горячее молоко с хлопьями', 150, 294),
('Бананы', 100, 82),
('Запеканка из картофеля с курицей', 150, 210),
('Кефир', 100, 40),
('Белый хлеб с сыром', 50, 152),
('Каша гречневая с молоком', 200, 206),
('Пряники', 50, 177),
('Какао с молоком', 150, 118),
('Яблоки', 100, 52),
('Салат овощной', 50, 18),
('Рассольник со сметаной', 150, 156),
('Тушеный картофель', 100, 140),
('Рыбная котлета', 60, 46),
('Компот фруктово-ягодный', 100, 57),
('Хлеб пшеничный', 30, 52),
('Сырники со сметаной', 100, 120),
('Молоко', 100, 42),
('Печенье песочное', 30, 150),
('Бананы', 100, 89),
('Отварная вермишель', 200, 240),
('Салат овощной', 100, 34),
('Яйцо отварное', 40, 42),
('Чай с молоком', 150, 12),
('Оладьи с яблоками и повидлом', 230, 394),
('Молоко', 150, 68);

INSERT INTO Rations(CountBr, Breakf, CountL, Lunch, CountP, Poldnik, CountD, Dinner)
VALUES (3, ARRAY[1, 2, 3], 2, ARRAY[4, 5], 2, ARRAY[6, 7], 3, ARRAY[8, 9, 10]),
       (3, ARRAY[11, 12, 13], 5, ARRAY[14, 5, 15, 16, 10], 2, ARRAY[17, 7], 2, ARRAY[18, 10]),
       (3, ARRAY[19, 12, 20], 4, ARRAY[21, 22, 23, 24], 3, ARRAY[25, 7, 26], 4, ARRAY[27, 28, 29, 10]);

INSERT INTO Person(Age, Gender, Type, Calories, Protein, Fat, Carbon, VitA, VitC, RationId)
VALUES ('2', 'М', 'Низкая', 1200, 36, 40, 174, '0.45', '45', 1),
       ('2', 'М', 'Умеренная', 1200, 36, 40, 174, '0.45', '45', 1),
       ('2', 'М', 'Высокая', 1200, 36, 40, 174, '0.45', '45', 1),
       ('2', 'Ж', 'Низкая', 1200, 36, 40, 174, '0.45', '45', 1),
       ('2', 'Ж', 'Умеренная', 1200, 36, 40, 174, '0.45', '45', 1),
       ('2', 'Ж', 'Высокая', 1200, 36, 40, 174, '0.45', '45', 1),
       ('3', 'М', 'Низкая', 1200, 63, 70, 233, '0.45', '45', 2),
       ('3', 'М', 'Умеренная', 1400, 63, 70, 233, '0.45', '45', 3),
       ('3', 'М', 'Высокая', 1400, 63, 70, 233, '0.45', '45', 3);
